app/controllers/admin/charities_controller.rb

  def create
    @charity = @app.create_charity(charity_params)
---
INSERT INTO "charities" ("name", "description", "total", "currency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Temple"], ["description", "temple test"], ["total", 0], ["currency", "THB"], ["created_at", "2015-12-29 09:47:45.939356"], ["updated_at", "2015-12-29 09:47:45.939356"]]

  def update
    @charity = @app.update_charity(params[:id],charity_params)
---
UPDATE "charities" SET "name" = $1, "updated_at" = $2 WHERE "charities"."id" = $3  [["name", "Templ"], ["updated_at", "2015-12-30 10:20:29.868049"], ["id", 1]]