app/controllers/admin/charities_controller.rb

  def create
    @charity = @app.create_charity(charity_params)
---
INSERT INTO "charities" ("name", "total", "currency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Elephant Nature Park"], ["total", 0], ["currency", "THB"], ["created_at", "2016-01-04 09:54:21.235221"], ["updated_at", "2016-01-04 09:54:21.235221"]]