app/controllers/website_controller.rb

  def donate

    if params[:charity] == "random"
      #abort(random.to_s)
      char_id = random
      charity = Charity.find_by(id: char_id)
---
SELECT  "charities".* FROM "charities" WHERE "charities"."id" = $1 LIMIT 1  [["id", 2]]