app/views/website/index.html.erb

    </li>
    <% @app.all_charities.each do |charity| %>
---
SELECT "charities".* FROM "charities"  ORDER BY "charities"."created_at" ASC